DataProcessors/ИнтерфейсВводаПолейЭМД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ИнтерфейсВводаПолейЭМД</Name>
			<Comment>Для избранных полей особые формы ввода</Comment>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Catalogs/КлассификаторыМинЗдрава.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>КлассификаторыМинЗдрава</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКлассификатора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКлассификаторовМинЗдрава</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НПП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Атрибуты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПереченьВредныхФакторовИРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПереченьВредныхФакторовИРабот</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПеречняДляМедОсмотра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПеречняДляМедОсмотров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерППДляСортировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВрачиСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛабораторныеИФункциональныеИсследованияСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МедицинскиеПротивопоказанияСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МедицинскиеПротивопоказанияСтрокаДляЗагрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьОсмотров</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПериодичностьОсмотров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВредноеВещество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВредныеВещества</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьНомерППиПриказа_302н</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьНомерПП_302н</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьНомерППДляСортировки_302н</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приказ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриказыМедосмотров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонОсмотраСправки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныHTML</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Врачи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Врач</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДействияМедосмотра</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоРекомендации</Name>
							<Comment>По показаниям врачей-специалистов</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипМедосмотра</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыМедосмотров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ограничение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОграниченияДействийМедосмотра</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеУчитыватьПриРасчетеЦены</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеТребуетОтметкиВыполнения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЛабораторныеИФункциональныеИсследования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Исследование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДействияМедосмотра</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоРекомендации</Name>
							<Comment>По показаниям врачей-специалистов</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипМедосмотра</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыМедосмотров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ограничение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОграниченияДействийМедосмотра</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеУчитыватьПриРасчетеЦены</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеТребуетОтметкиВыполнения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МедицинскиеПротивопоказания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Противопоказание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МедицинскиеПротивопоказания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипМедосмотра</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыМедосмотров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыВредныхВеществ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппаВредныхВеществ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ГруппыОпасныхВеществ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ИнтерфейсВводаПолейЭМД/Forms/СведенияОПрививках/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВредныеФакторы = ?(Параметры.Свойство("ВредныеФакторы"), Параметры.ВредныеФакторы, Неопределено);
	ПрофилактическиеПрививкиСФормы = ?(Параметры.Свойство("ПрофилактическиеПрививки"), Параметры.ПрофилактическиеПрививки, Неопределено);
	ПрофильРаботы = ?(Параметры.Свойство("ПрофильРаботы"), Параметры.ПрофильРаботы, Неопределено);
	
	Если ЗначениеЗаполнено(ВредныеФакторы) И ПрофильРаботы <> Неопределено Тогда
		УстановитьПараметрВыбораГруппыЗаболевания(ВредныеФакторы, ПрофильРаботы);
	КонецЕсли;
	
	ЗаполнитьПрофилактическиеПрививки(ПрофилактическиеПрививкиСФормы);
	
	УстановитьУсловноеОфрмление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьТекстПредставления();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ВопросПередЗакрытиемМодифицированнойФормы", ЭтотОбъект);
		ТекстВопроса = НСтр("ru='Данные были изменены. Сохранить изменения?'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Применить(Команда)
	
	ПрофилактическиеПрививкиРезультат = Новый Массив;
	СообщениеОбОшибке = "";
	СформированоСообщениеОбОшибке = Ложь;
	СформированоСообщениеОбОшибкеДифтерия = Ложь;
	Для Каждого Эл Из ПрофилактическиеПрививки Цикл
		Если (Не ЗначениеЗаполнено(Эл.ГруппаЗаболеваний) Или Не ЗначениеЗаполнено(Эл.ДатаВакцинации)) 
			И Не СформированоСообщениеОбОшибке 
		Тогда
			СообщениеОбОшибке = СообщениеОбОшибке + ?(ЗначениеЗаполнено(СообщениеОбОшибке), Символы.ПС, "")
								+ "Не заполнена ""Группа заболеваний"" или ""Дата вакцинации""";
			СформированоСообщениеОбОшибке = Истина;
		КонецЕсли;
		
		Если Эл.ГруппаЗаболеваний = ЭлементДифтерия И Не ЗначениеЗаполнено(Эл.ПорядковыйНомер) И Не СформированоСообщениеОбОшибкеДифтерия Тогда
			СообщениеОбОшибке = СообщениеОбОшибке + ?(ЗначениеЗаполнено(СообщениеОбОшибке), Символы.ПС, "")
								+ "Для группы заболевания ""Дифтерия"" не заполнен порядковый номер";
			СформированоСообщениеОбОшибкеДифтерия = Истина;
			
		КонецЕсли;
		
		ВозвращаемыеДанные = Новый Структура("ГруппаЗаболеваний, ДатаВакцинации, НаименованиеПрививки, Повторная, ПорядковыйНомер");
		ЗаполнитьЗначенияСвойств(ВозвращаемыеДанные, Эл);
		ПрофилактическиеПрививкиРезультат.Добавить(ВозвращаемыеДанные);
	КонецЦикла;
	Если ЗначениеЗаполнено(СообщениеОбОшибке) Тогда
		ОбщегоНазначения.СообщитьПользователю(СообщениеОбОшибке);
	Иначе
		Модифицированность = Ложь;
		ЭтотОбъект.Закрыть(ПрофилактическиеПрививкиРезультат);
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура Отмена(Команда)
	
	ЭтотОбъект.Закрыть(Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПрофилактическиеПрививкиПриИзменении(Элемент)
	УстановитьТекстПредставления();
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПрофилактическиеПрививкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Не Копирование Тогда
		ПараметрыФормы = Новый Структура("Отбор", СформироватьСтруктуруОтбора());
		ОповещениеПродолжения = Новый ОписаниеОповещения("ОбработкаВыбораГруппыДиагнозов", ЭтотОбъект);
		ОткрытьФорму("Справочник.КлассификаторыМинЗдрава.ФормаВыбора", ПараметрыФормы,,,,,ОповещениеПродолжения); 
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

&НаСервере
Процедура ЗаполнитьПрофилактическиеПрививки(ПрофилактическиеПрививкиСФормы)
	
	Если ПрофилактическиеПрививкиСФормы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Эл Из ПрофилактическиеПрививкиСФормы Цикл
		НоваяСтрока = ПрофилактическиеПрививки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Эл);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрВыбораГруппыЗаболевания(ВредныеФакторы, ПрофильРаботы)
	
	МассивОтбора = СформироватьОтборыГруппаЗаболеваний(ВредныеФакторы, ПрофильРаботы);
	Если МассивОтбора.Количество() > 0 Тогда
		ЗначенияПараметровВыбора = Новый ФиксированныйМассив(МассивОтбора);
		ПараметрВыбора = Новый ПараметрВыбора("Отбор.Ссылка", ЗначенияПараметровВыбора);
	Иначе
		ПараметрВыбора = Новый ПараметрВыбора("Отбор.ВидКлассификатора", Перечисления.ВидыКлассификаторовМинЗдрава.ГруппаЗаболеванийМИБП);
	КонецЕсли;
	
	МассивПараметрыВыбора = Новый Массив();
	МассивПараметрыВыбора.Добавить(ПараметрВыбора);
	ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметрыВыбора);
	Элементы.ПрофилактическиеПрививкиГруппаЗаболеваний.ПараметрыВыбора = ПараметрыВыбора;
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция СформироватьОтборыГруппаЗаболеваний(ВредныеФакторы, ПрофильРаботы)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КлассификаторыМинЗдрава.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КлассификаторыМинЗдрава КАК КлассификаторыМинЗдрава
		|ГДЕ
		|	КлассификаторыМинЗдрава.ВидКлассификатора = ЗНАЧЕНИЕ(Перечисление.ВидыКлассификаторовМинЗдрава.ГруппаЗаболеванийМИБП)
		|	И КлассификаторыМинЗдрава.УИДЕГИСЗ В(&УИДЕГИСЗ)
		|	И КлассификаторыМинЗдрава.ПометкаУдаления = ЛОЖЬ
		|	И КлассификаторыМинЗдрава.Архив = ЛОЖЬ";
	
	КодыОграничений = ПолучитьМассивКодовОграничений(ВредныеФакторы, ПрофильРаботы);
	Запрос.УстановитьПараметр("УИДЕГИСЗ", КодыОграничений); 
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьМассивКодовОграничений(ВредныеФакторы, ПрофильРаботы)
	
	МассивОграничений = Новый Массив;
	
	Для Каждого Эл Из ВредныеФакторы Цикл
		
		МассивОграниченийФактора = ПолучитьКодыОграниченийПоВредномуФактору(Эл, ПрофильРаботы);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивОграничений, МассивОграниченийФактора, Истина); 
		
	КонецЦикла;
	
	Возврат МассивОграничений;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКодыОграниченийПоВредномуФактору(ВредныйФактор, ПрофильРаботы)
	
	Если ВредныйФактор = Неопределено Или ВредныйФактор = Справочники.ПереченьВредныхФакторовИРабот.ПустаяСсылка() Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	ДанныеВредногоФактора = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ВредныйФактор, "НомерПП, Приказ");
	
	Если ДанныеВредногоФактора.Приказ = Справочники.ПриказыМедосмотров.Приказ29н Тогда
		СтрокаОграничений = Неопределено;
		Если ДанныеВредногоФактора.НомерПП = "23" Тогда
			СтрокаОграничений = ИнтеграцияЕГИСЗ_СЭМД.СтрокаОграниченийВакцинацииФактор23_230(ПрофильРаботы); 
		ИначеЕсли ДанныеВредногоФактора.НомерПП = "24" Тогда
			СтрокаОграничений = ИнтеграцияЕГИСЗ_СЭМД.СтрокаОграниченийВакцинацииФактор24_230();
		ИначеЕсли ДанныеВредногоФактора.НомерПП = "25" Тогда
			СтрокаОграничений = ИнтеграцияЕГИСЗ_СЭМД.СтрокаОграниченийВакцинацииФактор25_230();
		ИначеЕсли ДанныеВредногоФактора.НомерПП = "26" Тогда
			СтрокаОграничений = ИнтеграцияЕГИСЗ_СЭМД.СтрокаОграниченийВакцинацииФактор26_230();
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаОграничений) Тогда
			СтрокаОграничений = СтрЗаменить(СтрокаОграничений, " ", "");
			СтрокаОграничений = СтрЗаменить(СтрокаОграничений, Символы.ПС, "");
			МассивОграничений = СтрРазделить(СтрокаОграничений, ",", Ложь);
			ОграниченияЧисла = Новый Массив;
			Для Каждого Эл Из МассивОграничений Цикл
				Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Эл) Тогда
					ОграниченияЧисла.Добавить(Число(Эл));
				КонецЕсли;
			КонецЦикла;
			Возврат ОграниченияЧисла;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Новый Массив;
	
КонецФункции

&НаКлиенте
Процедура УстановитьТекстПредставления()
	
	Результат = МедосмотрыКлиент.ПолучитьПредставлениеСведенияОПривиках(ПрофилактическиеПрививки);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОфрмление()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КлассификаторыМинЗдрава.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КлассификаторыМинЗдрава КАК КлассификаторыМинЗдрава
	|ГДЕ
	|	КлассификаторыМинЗдрава.ВидКлассификатора = ЗНАЧЕНИЕ(Перечисление.ВидыКлассификаторовМинЗдрава.ГруппаЗаболеванийМИБП)
	|	И КлассификаторыМинЗдрава.УИДЕГИСЗ = 14
	|	И КлассификаторыМинЗдрава.ПометкаУдаления = ЛОЖЬ
	|	И КлассификаторыМинЗдрава.Архив = ЛОЖЬ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЭлементДифтерия = Выборка.Ссылка; 
		Элемент = УсловноеОформление.Элементы.Добавить();
		
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПрофилактическиеПрививкиПорядковыйНомер.Имя);
		
		ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		
		ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПрофилактическиеПрививки.ГруппаЗаболеваний");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Выборка.Ссылка; 
		
		ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПрофилактическиеПрививки.ПорядковыйНомер");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
		
		Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПередЗакрытиемМодифицированнойФормы(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Модифицированность = Ложь;
		Применить(Неопределено);
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СформироватьСтруктуруОтбора()
	
	СтруктураОтбора = Новый Структура;
	
	Для Каждого ЭлПараметрВыбора Из Элементы.ПрофилактическиеПрививкиГруппаЗаболеваний.ПараметрыВыбора Цикл 
		ИмяРеквизитаОтбора = СтрЗаменить(ЭлПараметрВыбора.Имя, "Отбор.", ""); 
		СтруктураОтбора.Вставить(ИмяРеквизитаОтбора, ЭлПараметрВыбора.Значение);
	КонецЦикла;
	
	Возврат СтруктураОтбора;
	
КонецФункции 

&НаКлиенте 
Функция ОбработкаВыбораГруппыДиагнозов(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ТекущиеДанные = Элементы.ПрофилактическиеПрививки.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			ТекущиеДанные.ГруппаЗаболеваний = Результат;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
